# BoundaryXTranslationFixed Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryXTranslationFixed Property
ParameterTypeId Class See Also
---
"X Translation - Fixed"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryXTranslationFixed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryXTranslationFixed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryXTranslationFixed {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace